<template>
  <div class="w-full flex justify-between items-start">
    <div class="flex items-center space-x-2">
      <div class="framework">
        <p class="flex items-center text-gray-600 space-x-1">
          <svg
            class="w-4 h-4"
            viewBox="0 0 50 50"
            fill="currentColor"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M41.9232 8H14.232C13.4162 8.00092 12.6342 8.32686 12.0573 8.90632C11.4805 9.48578 11.1561 10.2714 11.1551 11.0909V14.1818H8.07834C7.2626 14.1827 6.48054 14.5087 5.90373 15.0881C5.32691 15.6676 5.00245 16.4532 5.00154 17.2727V21.8791C5.00135 21.8892 5 21.899 5 21.9091C5 21.9191 5.00135 21.929 5.00154 21.939V38.9091C5.00245 39.7286 5.32691 40.5142 5.90373 41.0937C6.48054 41.6731 7.2626 41.9991 8.07834 42H35.7696C36.5853 41.9991 37.3674 41.6731 37.9442 41.0937C38.521 40.5142 38.8455 39.7286 38.8464 38.9091V35.8182H41.9232C42.7389 35.8173 43.521 35.4913 44.0978 34.9119C44.6746 34.3324 44.9991 33.5467 45 32.7273V11.0909C44.9991 10.2714 44.6746 9.48578 44.0978 8.90632C43.521 8.32686 42.7389 8.00092 41.9232 8ZM35.7696 17.2727L35.7698 20.3636H8.07834V17.2727H35.7696ZM35.7696 38.9091H8.07834V23.4545H35.77L35.7709 34.2424C35.7707 34.2526 35.7694 34.2625 35.7694 34.2727C35.7694 34.283 35.7707 34.293 35.7709 34.3032L35.7713 38.9091H35.7696ZM41.9232 32.7273H38.8464V17.2727C38.8455 16.4532 38.521 15.6676 37.9442 15.0881C37.3674 14.5087 36.5853 14.1827 35.7696 14.1818H14.232V11.0909H41.9232V32.7273Z"
            />
          </svg>
          <span class="text-xs">打开</span>
        </p>

        <div class="flex items-center space-x-1">
          <div class="flex items-center space-x-0.5">
            <input
              id="group"
              type="checkbox"
              :checked="multiOnGroup"
              @change="$emit('update:multiOnGroup', $event.target.checked)"
            >
            <label
              for="group"
              class="text-xxs text-gray-500"
            >在组内打开</label>
          </div>
          <input
            class="px-1 border border-gray-300 rounded text-xxs"
            :class="{ 'opacity-10': !multiOnGroup }"
            type="text"
            placeholder="输入 group 名称"
            :disabled="!multiOnGroup"
            :value="groupName"
            @input="$emit('update:groupName', $event.target.value)"
          >
          <div
            class="relative"
            :class="{ 'opacity-10': !multiOnGroup }"
          >
            <button
              title="select group color"
              :disabled="!multiOnGroup"
              class="w-3 h-3 rounded-full"
              :style="{
                'background': groupColor
              }"
              @click="showColorPalette = true"
            />
            <div
              v-show="showColorPalette"
              class="absolute -top-10 flex p-2 bg-white space-x-2 rounded-sm shadow"
            >
              <button
                v-for="color of colorScheme"
                :key="color.name"
                :title="color.name"
                :disabled="!multiOnGroup"
                class="w-4 h-4 rounded-full opacity-80 hover:opacity-100"
                :class="{ 'ring-2 ring-gray-400': groupColor === color.value }"
                :style="{
                  'background': color.value
                }"
                @click="setGroupColorHandler(color.value)"
              />
            </div>
          </div>
        </div>

        <div class="flex items-center space-x-1">
          <button
            class="px-2 py-0.5 rounded bg-green-400 hover:bg-green-600 text-white text-xxs"
          >
            所有书签
          </button>
          <button
            class="px-2 py-0.5 rounded bg-green-400 hover:bg-green-600 text-white text-xxs"
          >
            选中书签
          </button>
        </div>
      </div>
      <div class="framework">
        <p class="flex items-center text-gray-600 space-x-1">
          <svg
            class="w-4 h-4"
            viewBox="0 0 50 50"
            fill="currentColor"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M16.3349 15.0472C16.1999 14.9131 16.0927 14.7538 16.0197 14.5786C15.9466 14.4033 15.909 14.2155 15.909 14.0258C15.9091 13.8361 15.9467 13.6482 16.0199 13.473C16.093 13.2978 16.2002 13.1385 16.3353 13.0044L23.9716 5.42291C24.2444 5.15212 24.6143 5 25 5C25.3857 5 25.7556 5.15212 26.0284 5.42291L33.6647 13.0044C33.8023 13.138 33.9118 13.2973 33.9869 13.4732C34.0621 13.6491 34.1013 13.838 34.1024 14.0291C34.1035 14.2201 34.0664 14.4095 33.9933 14.5862C33.9202 14.7629 33.8125 14.9234 33.6765 15.0585C33.5405 15.1936 33.3788 15.3006 33.2009 15.3732C33.0229 15.4459 32.8322 15.4827 32.6399 15.4817C32.4475 15.4806 32.2572 15.4417 32.0801 15.3671C31.903 15.2925 31.7425 15.1838 31.608 15.0472L26.4545 9.93102V26.6667C26.4545 27.0498 26.3013 27.4172 26.0285 27.6881C25.7557 27.959 25.3858 28.1111 25 28.1111C24.6142 28.1111 24.2443 27.959 23.9715 27.6881C23.6987 27.4172 23.5455 27.0498 23.5455 26.6667V9.93102L18.392 15.0472C18.2569 15.1814 18.0966 15.2878 17.9201 15.3604C17.7436 15.433 17.5545 15.4704 17.3635 15.4704C17.1724 15.4704 16.9833 15.433 16.8068 15.3604C16.6303 15.2878 16.47 15.1814 16.3349 15.0472ZM38.0909 19.4445H33.7273C33.3415 19.4445 32.9715 19.5967 32.6988 19.8675C32.426 20.1384 32.2727 20.5058 32.2727 20.8889C32.2727 21.272 32.426 21.6394 32.6988 21.9103C32.9715 22.1812 33.3415 22.3334 33.7273 22.3334H38.0909V41.1111H11.9091V22.3334H16.2727C16.6585 22.3334 17.0285 22.1812 17.3012 21.9103C17.574 21.6394 17.7273 21.272 17.7273 20.8889C17.7273 20.5058 17.574 20.1384 17.3012 19.8675C17.0285 19.5967 16.6585 19.4445 16.2727 19.4445H11.9091C11.1378 19.4453 10.3984 19.75 9.85301 20.2916C9.30764 20.8331 9.00087 21.5674 9 22.3334V41.1111C9.00087 41.877 9.30764 42.6113 9.85301 43.1529C10.3984 43.6945 11.1378 43.9991 11.9091 44H38.0909C38.8622 43.9991 39.6016 43.6945 40.147 43.1529C40.6924 42.6113 40.9991 41.877 41 41.1111V22.3334C40.9991 21.5674 40.6924 20.8331 40.147 20.2916C39.6016 19.75 38.8622 19.4453 38.0909 19.4445Z"
            />
          </svg>
          <span class="text-xs">导出为 JSON</span>
        </p>

        <button
          class="px-2 py-0.5 rounded bg-green-400 hover:bg-green-600 text-white text-xxs"
        >
          所有书签
        </button>
        <button class="px-2 py-0.5 rounded bg-green-400 hover:bg-green-600 text-white text-xxs">
          选中书签
        </button>
      </div>
      <div class="framework">
        <p class="flex items-center text-gray-600 space-x-1">
          <svg
            class="w-4 h-4"
            viewBox="0 0 50 50"
            fill="currentColor"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M42.4821 40.8585H25.4653L32.3648 34.0395L32.368 34.0368L32.3708 34.0335L43.6059 22.9299C44.4986 22.0454 45 20.8471 45 19.5978C45 18.3485 44.4986 17.1501 43.6059 16.2656L34.6155 7.38017C33.7213 6.49646 32.5086 6 31.2441 6C29.9795 6 28.7668 6.49646 27.8727 7.38017L16.6364 18.4853L16.6344 18.4871L16.6326 18.489L5.39647 29.594C4.50232 30.4777 4 31.6762 4 32.926C4 34.1757 4.50232 35.3743 5.39647 36.258L12.7648 43.54C13.0629 43.8345 13.467 43.9999 13.8885 44H42.4821C42.9036 44 43.3078 43.8345 43.6059 43.5399C43.9039 43.2454 44.0714 42.8458 44.0714 42.4293C44.0714 42.0127 43.9039 41.6132 43.6059 41.3186C43.3078 41.024 42.9036 40.8585 42.4821 40.8585ZM30.1203 9.60178C30.2679 9.45587 30.4431 9.34013 30.6359 9.26116C30.8287 9.18219 31.0353 9.14155 31.2441 9.14155C31.4528 9.14155 31.6594 9.18219 31.8523 9.26116C32.0451 9.34013 32.2203 9.45587 32.3678 9.60178L41.3582 18.4873C41.6558 18.7821 41.8229 19.1815 41.8229 19.5979C41.8229 20.0143 41.6558 20.4137 41.3582 20.7085L31.2442 30.7045L20.0063 19.5978L30.1203 9.60178ZM14.5468 40.8585L7.64433 34.0366C7.4967 33.8908 7.37959 33.7177 7.29968 33.5271C7.21978 33.3365 7.17866 33.1323 7.17866 32.926C7.17866 32.7197 7.21978 32.5155 7.29968 32.3249C7.37959 32.1343 7.4967 31.9612 7.64433 31.8154L17.7584 21.8194L28.9963 32.9261L20.9702 40.8585H14.5468Z"
            />
          </svg>
          <span class="text-xs">清空</span>
        </p>

        <button class="px-2 py-0.5 rounded bg-red-400 hover:bg-red-600 text-white text-xxs">
          Pin 列表
        </button>
        <button class="px-2 py-0.5 rounded bg-red-400 hover:bg-red-600 text-white text-xxs">
          选中书签
        </button>
      </div>
      <div class="framework">
        <p class="flex items-center text-gray-600 space-x-1">
          <svg
            class="w-4 h-4"
            viewBox="0 0 50 50"
            fill="currentColor"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M41.5 11H34.0007V9.5C33.9994 8.30694 33.5249 7.16312 32.6813 6.3195C31.8376 5.47588 30.6938 5.00134 29.5007 5H20.5007C19.3077 5.00134 18.1639 5.47588 17.3202 6.3195C16.4766 7.16312 16.0021 8.30694 16.0007 9.5V11H8.5C8.10217 11 7.72064 11.158 7.43934 11.4393C7.15804 11.7206 7 12.1022 7 12.5C7 12.8978 7.15804 13.2794 7.43934 13.5607C7.72064 13.842 8.10217 14 8.5 14H10V41C10.0009 41.7954 10.3173 42.5579 10.8797 43.1203C11.4421 43.6827 12.2046 43.9991 13 44H37C37.7954 43.9991 38.5579 43.6827 39.1203 43.1203C39.6827 42.5579 39.9991 41.7954 40 41V14H41.5C41.8978 14 42.2794 13.842 42.5607 13.5607C42.842 13.2794 43 12.8978 43 12.5C43 12.1022 42.842 11.7206 42.5607 11.4393C42.2794 11.158 41.8978 11 41.5 11ZM19.0007 9.5C19.0012 9.10233 19.1594 8.72109 19.4406 8.43989C19.7218 8.15869 20.1031 8.0005 20.5007 8H29.5007C29.8984 8.0005 30.2797 8.15869 30.5609 8.43989C30.8421 8.72109 31.0003 9.10233 31.0007 9.5V11H19.0007V9.5ZM37 41H13V14H37V41ZM22.0007 21.5V33.5C22.0007 33.8978 21.8427 34.2794 21.5614 34.5607C21.2801 34.842 20.8986 35 20.5007 35C20.1029 35 19.7214 34.842 19.4401 34.5607C19.1588 34.2794 19.0007 33.8978 19.0007 33.5V21.5C19.0007 21.1022 19.1588 20.7206 19.4401 20.4393C19.7214 20.158 20.1029 20 20.5007 20C20.8986 20 21.2801 20.158 21.5614 20.4393C21.8427 20.7206 22.0007 21.1022 22.0007 21.5ZM31.0007 21.5V33.5C31.0007 33.8978 30.8427 34.2794 30.5614 34.5607C30.2801 34.842 29.8986 35 29.5007 35C29.1029 35 28.7214 34.842 28.4401 34.5607C28.1588 34.2794 28.0007 33.8978 28.0007 33.5V21.5C28.0007 21.1022 28.1588 20.7206 28.4401 20.4393C28.7214 20.158 29.1029 20 29.5007 20C29.8986 20 30.2801 20.158 30.5614 20.4393C30.8427 20.7206 31.0007 21.1022 31.0007 21.5Z"
            />
          </svg>
          <span class="text-xs">删除</span>
        </p>

        <button
          class="px-2 py-0.5 rounded bg-red-400 hover:bg-red-600 text-white text-xxs"
        >
          Pin 列表的书签
        </button>
        <button class="px-2 py-0.5 rounded bg-red-400 hover:bg-red-600 text-white text-xxs">
          选中书签
        </button>
      </div>
    </div>

    <button
      title="hide pin list"
      class="h-center px-1 py-0.5 text-white bg-blue-400 hover:bg-blue-600 border-2 border-blue-400 hover:border-blue-600 rounded space-x-0.5"
      @click="$emit('change-browser-type', 'all')"
    >
      <svg
        class="w-4 h-4"
        viewBox="0 0 50 50"
        fill="currentColor"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M43.1421 21.1207L32.4296 31.8433C33.2635 34.1663 33.6093 38.0521 30.0154 42.833C29.7637 43.1678 29.4432 43.4446 29.0754 43.6446C28.7077 43.8447 28.3013 43.9634 27.8837 43.9927C27.815 43.9976 27.7465 44 27.678 44C27.2932 44 26.9121 43.924 26.5566 43.7766C26.2011 43.6291 25.8781 43.4129 25.6061 43.1404L16.7852 34.3114L10.4992 40.6032C10.3633 40.7393 10.2018 40.8473 10.0242 40.9209C9.84652 40.9946 9.65611 41.0325 9.46381 41.0325C9.27151 41.0325 9.0811 40.9946 8.90344 40.9209C8.72578 40.8473 8.56435 40.7393 8.42838 40.6032C8.29241 40.4671 8.18454 40.3055 8.11096 40.1277C8.03737 39.9499 7.99949 39.7593 7.99949 39.5668C7.99949 39.3743 8.03737 39.1838 8.11096 39.0059C8.18454 38.8281 8.29241 38.6665 8.42838 38.5304L14.7144 32.2386L5.85728 23.3734C5.56668 23.0822 5.34054 22.733 5.19358 22.3486C5.04661 21.9642 4.98211 21.5531 5.00425 21.1421C5.0264 20.7311 5.13471 20.3294 5.32213 19.963C5.50955 19.5967 5.7719 19.2739 6.09212 19.0157C10.746 15.2578 15.2003 15.9979 17.15 16.61L27.8929 5.8572V5.85701C28.4426 5.3082 29.1873 5 29.9638 5C30.7402 5 31.4849 5.3082 32.0346 5.85701L43.1423 16.9753C43.4142 17.2475 43.6299 17.5707 43.7771 17.9263C43.9243 18.2819 44 18.6631 44 19.048C44 19.433 43.9242 19.8141 43.777 20.1698C43.6298 20.5254 43.4141 20.8485 43.1421 21.1207Z"
        />
      </svg>
      <span class="text-sm font-bold">2</span>
    </button>
  </div>
</template>

<script>
import { ref } from 'vue';

export default {
  props: {
    bookmarkOpenMode: {
      type: String,
      default: 'all',
    },
    multiOnGroup: Boolean,
    groupName: {
      type: String,
      default: '',
    },
    groupColor: {
      type: String,
      default: '#1A73E8',
    },
  },
  emits: ['change-browser-type', 'update:multiOnGroup', 'update:groupName', 'set-group-color'],
  setup(props, context) {
    const showColorPalette = ref(false);
    // group color
    const colorScheme = [
      {
        name: 'grey',
        value: '#5F6368',
      },
      {
        name: 'blue',
        value: '#1A73E8',
      },
      {
        name: 'red',
        value: '#D93025',
      },
      {
        name: 'yellow',
        value: '#E37400',
      },
      {
        name: 'green',
        value: '#188038',
      },
      {
        name: 'pink',
        value: '#D01884',
      },
      {
        name: 'purple',
        value: '#9334E6',
      },
      {
        name: 'cyan',
        value: '#007B83',
      },
    ];

    function setGroupColorHandler(value) {
      context.emit('set-group-color', value);
      showColorPalette.value = false;
    }

    return {
      showColorPalette,
      colorScheme,
      setGroupColorHandler,
    };
  },
};
</script>

<style lang="scss" scoped>
.text-xxs {
  font-size: 10px;
}

.btn {
  @apply flex justify-center items-center rounded hover:bg-gray-200;
}

.h-center {
  @apply flex justify-center items-center;
}

.framework {
  @apply flex flex-col space-y-1 p-2 rounded border border-gray-200 border-dashed;
}
</style>
